### Import Pandas Library

In [47]:
import pandas as pd

### Read data from provided CSV file

In [48]:
df = pd.read_csv('tips.csv')

### Display the type of Data

In [49]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

### Display columns of Data Frame

In [50]:
df.loc[1]

total_bill     10.34
tip             1.66
sex             Male
smoker            No
day              Sun
time          Dinner
size               3
Name: 1, dtype: object

### Extract and display the first few rows of the following columns 
    - Total_Bill
    - Tip
    - Sex

In [51]:
total_bill = df["total_bill"]
tip = df["tip"]
sex = df['sex']
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

### Display and Sort values of Day and Total_Bill in Descending Order

In [52]:
df.sort_values(['day', 'total_bill'],ascending=False)
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

### Display Unique Days from Data

In [53]:
uniq_date = df["day"]

uniq_date.unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

### Change the Value of Tip in Second Row to '2' and Display the Data

In [54]:
df.iloc[1,1] = 2
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  2.00    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

### Add new column "TOTAL" = Total Bill + Tip

In [55]:
df["Total"] = df.total_bill + df.tip
df

     total_bill   tip     sex smoker   day    time  size  Total
0         16.99  1.01  Female     No   Sun  Dinner     2  18.00
1         10.34  2.00    Male     No   Sun  Dinner     3  12.34
2         21.01  3.50    Male     No   Sun  Dinner     3  24.51
3         23.68  3.31    Male     No   Sun  Dinner     2  26.99
4         24.59  3.61  Female     No   Sun  Dinner     4  28.20
..          ...   ...     ...    ...   ...     ...   ...    ...
239       29.03  5.92    Male     No   Sat  Dinner     3  34.95
240       27.18  2.00  Female    Yes   Sat  Dinner     2  29.18
241       22.67  2.00    Male    Yes   Sat  Dinner     2  24.67
242       17.82  1.75    Male     No   Sat  Dinner     2  19.57
243       18.78  3.00  Female     No  Thur  Dinner     2  21.78

[244 rows x 8 columns]

### Store the names of columns in "Cols" variable

In [69]:
Cols = df.columns
Cols

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size', 'Total'], dtype='object')

### Create a List (tmp) of Column in following order
### 6, 2, 4, 5

In [70]:
# tmp = list[Cols[6], Cols[2], Cols[4],Cols[5]]
tmp = [df.iloc(6), df.iloc(2)]

ValueError: No axis named 6 for object type DataFrame

### Create a new Dataframe with Columns from 'Tmp'

In [65]:
df2 = pd.DataFrame(tmp)
df2

                                     0
0  *list['size', 'sex', 'day', 'time']

In [59]:
df2

list['size', 'sex', 'day', 'time']